[{"name": "Elendil", "start": 3320, "end": 3441, "era": 0, "biog": "Elendil (also known as Elendil the Tall or Elendil the Fair, and Ælfwine \"Elf-friend\"[2]) was the father of Isildur and Anárion, and the first High King of Gondor and Arnor and first King of all the Dúnedain. He was killed by Sauron in the War of the Last Alliance and would was known as the greatest warrior of all the Dúnedain.\nElendil was born in 3119 of the Second Age in Númenor, son of Amandil, Lord of Andúnië and leader of the \"Faithful\" (those who remained loyal to the Valar), who maintained a strong friendship with the elves and preserved the old ways against the practices of Ar-Pharazôn and Sauron. For this Sauron hated Amandil, and by extension Elendil, the most out of all the Númenóreans.[3] He was married to an unnamed Númenórean woman no doubt of the same upbringing and noble blood to which they had two sons: Isildur and Anárion. It is not known whether she followed him to Middle-earth after the Fall of Númenor.[3]\nWhen Ar-Pharazôn and Sauron were preparing their assault on Valinor, Amandil told him to gather the Faithful in Romenna and escape to Middle-Earth. Elendil did as his father told him, and gathered the Faithful and their wives and children in 9 ships, and waited just off the coast.[3]\n"}, {"name": "Isildur", "start": 3441, "end": 2, "era": 0, "biog": "Isildur was the oldest son of Elendil and brother to Anárion. As the High King of Gondor and Arnor, Isildur and his brother Anárion jointly ruled Gondor in the South, while their father dwelt in the North.\nDuring the War of the Last Alliance, Isildur cut the One Ring from Sauron's hand, but he refused to destroy it. Isildur was later killed by Orcs and the Ring was lost in the Disaster of the Gladden Fields for nearly 2,500 years. His refusal to destroy the Ring allowed Sauron's spirit to endure and ensured that he would remain a threat to Middle-earth for years to come. Isildur's bloodline survived in the Dúnedain of the North and his heirs would help end Sauron's power in the War of the Ring.\nIsildur was born in Númenor in the year SA 3209 of the Second Age.[1] He had a younger brother Anárion in SA 3219. They lived at the haven of Rómenna on the east coast of the island of Númenor. Their father was Elendil and their grandfather was Amandil, the Lord of Andúnië. The Lords of Andúnië were descended from the Kings of Númenor through Silmarien, the daughter of the fourth King of Númenor, Tar-Elendil.[2]\n"}, {"name": "Meneldil", "start": 2, "end": 158, "era": 1, "biog": "Meneldil was the third King of Gondor.\nMeneldil was born in Númenor a year before its fall.[1] Son and fourth child of Anárion, he was said to be the last child born in Númenor before its downfall. He had three older siblings, apparently all sisters. \nAfter the War of the Last Alliance in which his father Anárion was slain, for a few years Meneldil was groomed by his uncle Isildur to rule Gondor, since Isildur and his sons intended to go to the North to rule Arnor.  According to Unfinished Tales, Meneldil was farsighted and well-pleased at the planned departure of Isildur, hoping that affairs in the North would keep them occupied.  Meneldil became the third King of Gondor in TA 2 after the death of his uncle Isildur in the Disaster at the Gladden Fields.  Meneldil was the first King of Gondor who ruled independently from the High Kingdom of the Dúnedain, Arnor.\n"}, {"name": "Cemendur", "start": 158, "end": 238, "era": 1, "biog": "Cemendur was the fourth King of Gondor.\nCemendur succeeded his father Meneldil to the throne of Gondor in TA 158. Very little is known of his reign, only that it was a peaceful one like most all of the very early Kings of Gondor. He died in TA 238 after a rule of eighty years and two hundred eighty years of life and was succeeded by his son Eärendil.[2]\nA much earlier Cemendur (b. SA 575) was a descendant of Elros, and the son of Axantur. He had two children: a daughter Írildë, and a son Hallatan. Hallatan was the father of Hallacar, the husband of Tar-Ancalimë.[3]\n"}, {"name": "Eärendil of Gondor", "start": 238, "end": 324, "era": 1, "biog": "Eärendil was the fifth King of Gondor.\nEärendil was the son of Cemendur. During his reign there were no significant events, which suggests a peaceful reign. He died in TA 324 after ruling Gondor for 86 years and having 276 years of life and was succeeded by his son Anardil.\nEärendil was named after Eärendil the Mariner, a Half-elf of the First Age. Eärendil was a Quenya name which means \"Lover of the Sea\", from eä (\"sea\") and the suffix -ndil (\"devoted to, friend, lover\").[3][4] His mother-name is Ardamírë \"Arda-jewel\", from the Quenya mírë (\"jewel\").[5]\n"}, {"name": "Anardil", "start": 324, "end": 411, "era": 1, "biog": "Anardil was the sixth King of Gondor.\nAnardil was born in TA 136.[1] He ascended to the throne after the death of his father Eärendil in TA 324. No notable events were recorded for his reign, except that he was the last king to dwell in Osgiliath during the summer, as his son rebuilt and expanded Minas Anor. Anardil died in TA 411 aged 275 after a rule of eighty-seven years and was succeeded by his son Ostoher.[2]\nThe name Anardil is a Quenyan word that meant \"devoted to the sun\" or \"friend of the sun\". It is made from the words anar, meaning \"sun\", and -dil (another form of the more common ending -ndil), meaning \"devoted\" or \"friend\". A much earlier Anardil was the birth-name of Tar-Aldarion.[citation needed]\n"}, {"name": "Ostoher", "start": 411, "end": 491, "era": 1, "biog": "Ostoher was the son and successor of King Anardil of Gondor and he became the seventh King upon Anardil's death in TA 411.\nHe moved his summer residence from the capital city of Osgiliath to the fortress of Minas Anor in TA 420. During this time he rebuilt and greatly added to it and over time it would become a city as well as a fortress, until after the Great Plague of 1636 when it became the capital of Gondor as Minas Tirith, over twelve-hundred years later.\nIn the last two years of his reign the Easterlings started attacks on Gondor. Due to his advanced age, he sent his son Tarostar (later known as Rómendacil I) to meet the Easterling threat and Tarostar defeated[3] the Easterlings into eventual submission.[4]\n"}, {"name": "Rómendacil I", "start": 491, "end": 541, "era": 1, "biog": "Rómendacil I was the eighth King of Gondor.\nRómendacil was born with the name Tarostar the son of King Ostoher. When the Easterlings invaded in TA 490, the young Tarostar as crown-prince was charged with fighting them as his father was too old. He succeeded his father upon his death in TA 492. He rode against them in many battles and finally defeated them by TA 500. After the victory he renamed himself to Rómendacil, meaning \"East-victor\".\nIt was he that created the office of the Steward of Gondor and they would be Men of wisdom and learning that would serve as high councilors to the king.[3]  This act set the stage for a line of men, known as the House of Húrin that would later be the rulers of Gondor when the line of the kings failed in TA 2050.\n"}, {"name": "Turambar", "start": 541, "end": 667, "era": 1, "biog": "Turambar was the the ninth King of Gondor.\nTurambar was the son and successor of Rómendacil I. He ascended to the throne in TA 541 at a very young age. He avenged the death of his father and proceeded to conquer large parts of Rhûn from the Easterlings expanding Gondor further into the east. The conquered territories became known as the East-lands province of Gondor. He was the longest reigning king since Meneldil, ruling for 126 years. He was succeeded by his son Atanatar I upon his death in TA 667 at the age of two-hundred and seventy.[2]\nTurambar means \"master of doom\" in the Quenya language.[3] He was no doubt named after Túrin Turambar, a tragic hero from the First Age.\n"}, {"name": "Atanatar I", "start": 667, "end": 748, "era": 1, "biog": "Atanatar I was the tenth King of Gondor.\nAtanatar was the son of Turambar and succeeded his father to the throne of Gondor in TA 667. His reign was uneventful and presumably peaceful. He died in TA 748 and was succeeded by his son Siriondil.[2]\nAtanatar was a Quenya word meaning 'man-father'.[3]\n"}, {"name": "Siriondil", "start": 748, "end": 830, "era": 1, "biog": "Siriondil was the eleventh King of Gondor.\nSiriondil became King of Gondor in TA 748 after the death of his father Atanatar I. He had two sons, Tarannon and Tarciryan. His reign was without notable events and probably peaceful. He ruled for eighty-two years and died in TA 830 at the age of two-hundred and sixty years of age and was succeeded by his son, Tarannon, who had the regnant name of Falastur.[2][1]\nThe name Siriondil probably meant 'River-[3]lover' or 'River-friend' in Quenya.[4]\n"}, {"name": "Tarannon Falastur", "start": 830, "end": 913, "era": 1, "biog": "Tarannon was the twelfth King of Gondor.\nTarannon succeeded his father Siriondil in TA 830. His brother was Tarciryan. He started the construction of Gondor's navies, and became known as the first of the so-called 'Ship-kings'. Under his policies and successful rule, Gondor's extended its power to the west and south of the Mouths of Anduin. He, along with Narmacil I, was one of two childless Kings of Gondor — meaning that he was a \"breakpoint\" in the bloodline. Nevertheless his rule was marked by such vigorous naval expansion that at his coronation he took the regnal name of Falastur, which meant 'Lord of the Coasts'.[2]\nDespite his successes, his reign was troubled by the intrigues of his own wife Queen Berúthiel who spied on everyone within the kingdom. Eventually, he grew tired of her after she had gone too far and send her and her cats in into exile in the south.[3] As a result of his wife's exile, he died childless (in TA 913) and was succeeded by his nephew Eärnil I.[2]\n"}, {"name": "Eärnil I", "start": 913, "end": 936, "era": 1, "biog": "Eärnil I was the thirteenth King of Gondor and the second Ship-king.\nEärnil was born in TA 736[1] to Tarciryan, the brother of King Tarannon Falastur. Tarannon Falastur died without a natural heir and Eärnil, his nephew succeeded him in TA 913. His policies where to continue to expand the realm of Gondor. He repaired the ancient port of Pelargir and build up a great naval fleet. He later laid siege to the enemy realm of Umbar in TA 933 and captured it.[2][3] He was tragically lost at sea near Umbar in TA 936.[4] and was succeeded by his son Ciryandil.[1]\nEärnil was a Quenyan word that meant 'Sea-lover'.[5]\n"}, {"name": "Ciryandil", "start": 936, "end": 1015, "era": 1, "biog": "Ciryandil was the fourteenth King of Gondor and the third Ship-king.\nCiryandil was born in the year TA 820 and succeeded his father Eärnil I in TA 936.[1] During his reign, he continued Eärnil's naval policies and spent his life defending the recently captured port of Umbar against the Black Númenóreans who had lived there before, and the Haradrim who wished to capture the port.\nIn TA 1015 after a reign of 79 years, he was slain while Umbar was besieged. He was succeeded by his son Ciryaher (also known as Hyarmendacil).[2]\n"}, {"name": "Hyarmendacil I", "start": 1015, "end": 1149, "era": 1, "biog": "Hyarmendacil I was the fifteenth King of Gondor.\nHyarmendacil was born Ciryaher to King Ciryandil who was slain defending Umbar while being besieged by the Haradrim. As Gondor's enemies to the south had yet to be subdued or pacified, he began his reign by reorganizing Gondor's armies. He declared war on the Haradrim in TA 1050 and finally defeated them. The Haradrim were forced to recognize him as their lord and king and paid tribute to Gondor, and their sons where forced to live as hostages in the court of the king. After this victory, he called himself Hyarmendacil, meaning South-victor.\nAfter the defeat of Harad, Gondor became very rich and under his reign the realm reached its greatest extent and power. The passes of Mordor were well guarded by well-kept fortresses, so evil found no chance to spawn during Hyarmendacil's reign. No one dared to contest his power and Gondor was at peace for the rest of his long reign of 134 years. He died in TA 1149 at the age of two-hundred and fifty and was the fourth and last of the Ship-kings. He was succeeded by Atanatar II, his lesser interested in ruling son.[2]\n"}, {"name": "Atanatar II", "start": 1149, "end": 1226, "era": 1, "biog": "Atanatar II was the sixteenth King of Gondor.\nGondor enjoyed its greatest wealth and power under him.\nAtanatar was born in the year TA 977.[1] Atanatar succeeded his father Hyarmendacil I in TA 1149 as the sixteenth King of Gondor. His wealth was so great that historians remarked that \"precious stones are pebbles in Gondor for children to play with\". He was also known as Atanatar Alcarin, \"Atanatar the Glorious,\" (alcarin being the Quenya word for glorious), but the deeds of Atanatar weren't as glorious as his appellation would indicate. Atanatar made no effort to expand or maintain the power that his father commanded and the guard on Mordor was neglected. Therefore his reign is seen as the start of Gondor's decline before the War of the Ring.\n"}, {"name": "Narmacil I", "start": 1226, "end": 1294, "era": 1, "biog": "Narmacil I was the seventeenth King of Gondor after the death of his father Atanatar II Alcarin in TA 1226. Like Falastur before him, he was notable for his childlessness.\nNarmacil was born in the year TA 1049 to Atanatar II and his unnamed wife. He was as lazy as his father and was soon tired of being King. He reigned as king properly for fourteen years. Then, probably intending to pursue his own personal pleasures and activities, he created the noble title of Regent and surrendered practical rule to his nephew Minalcar by TA 1240 (who would eventually become King in his own right).\nDuring his reign, the Easterlings started to become a threat again and his regent's main concern was making alliance with the tribes of the Northmen to help fight against them.[2] After this event it is unknown whether Narmacil retained any power. He died childless in TA 1294 after sixty-eight years of mostly inactive rule and was succeeded by his brother Calmacil.[2]\n"}, {"name": "Calmacil", "start": 1294, "end": 1304, "era": 1, "biog": "\nCalmacil was the eighteenth King of Gondor and the brother of Narmacil I, whom he succeeded as King in TA 1294.\nCalmacil's reign lasted for ten years, in which his son Minalcar (known named Rómendacil II) continued his function as regent, a function he had held during Narmacil's reign.\n"}, {"name": "N/a", "start": 1240, "end": 1304, "era": 1, "biog": "\nCalmacil was the eighteenth King of Gondor and the brother of Narmacil I, whom he succeeded as King in TA 1294.\nCalmacil's reign lasted for ten years, in which his son Minalcar (known named Rómendacil II) continued his function as regent, a function he had held during Narmacil's reign.\n"}, {"name": "N/A", "start": 0, "end": 0, "era": -1, "biog": "N/A"}, {"name": "Valacar", "start": 1366, "end": 1432, "era": 1, "biog": "Valacar (TA 1194 - TA 1432, r. TA 1366 - TA 1432) was the twentieth King of Gondor and the son of Rómendacil II, whom he succeeded in TA 1366.\nHis ascension brought great unrest to Gondor, for he was sent by his father as an ambassador to Rhovanion to acquaint himself with the Northmen. On this mission he married Vidumavi, the daughter of Vidugavia, the King of Rhovanion. Because the Northmen were Middle Men, the Dúnedain in Gondor were afraid that this marriage might spoil the Númenórean blood of its kings.\nHis wife died early as was common with the Northmen but she bore him a son, Eldacar his future successor.\n"}, {"name": "Eldacar of Gondor", "start": 1432, "end": 1437, "era": 1, "biog": "Eldacar, born as \"Vinitharya\", was the twenty-first King of Gondor and the son of Valacar and the northwoman Vidumavi, he was born during the time his father was acting as ambassador to Rhovanion.\nEldacar was born as Vinitharya in the Kingdom of Rhovanion, whose migthiest prince was his maternal grandfather Vidugavia. In TA 1260, he was brought to Gondor by his father on orders of his paternal grandfather, king Romendacil II. His reign saw the already lingering unrest explode, for he was the son of princess Vidumavi, a daughter of the Northmen King Vidugavia, a lesser man. After ascending the throne in TA 1432, he reigned for five years when he was deposed and driven from Osgiliath into exile to Rhovanion by his far relative Castamir the Usurper, who reigned for ten bloody years in a civil war called the Kin-strife. While being in exile he slowly gathered support from the Northmen and the Dúnedain from the northern parts of Gondor. One reason for their hatred was that Castamir had executed Ornendil, Eldacar's firstborn son.\nBy TA 1447, he had finally gathered enough strength and support and marched south with his army and slew Castamir personally in battle at the Crossings of Erui. But Castamir's sons escaped and Gondor's purest blood was split. He besieged Pelargir where Castamir's sons held out the last resistance. Eldacar had no ships at his disposal (for Castamir was the Lord of Ships of Gondor) and Castamir's sons finally fled to Umbar.\n"}, {"name": "Castamir the Usurper", "start": 1437, "end": 1447, "era": 1, "biog": "Castamir the Usurper usurped the throne of Gondor from Eldacar, ruling from TA 1437 to 1447 of the Third Age, until he was violently deposed at the Battle of Erui.\nThe great-grandson of the unremarkable King Calmacil, Castamir was not in line for the throne, but his royal background had made him the Lord of Ships under the previous king, Valacar. His lineage and influence left him in a position to challenge the current king, Eldacar, who was only half Dúnadan. As King Valacar's only son, Eldacar was the legitimate heir to the throne, but his half Rhovanion lineage angered citizens who believed in a pure dúnedain royalty. Capitalizing on what became outright protest against the current king, Castamir was able to incite rebellion and besiege Eldacar within the city Osgiliath in TA 1437 of the Third Age. The city was set on fire by Castamir's troops, destroying the famed Dome of Stars. Shortly thereafter, Eldacar fled the city and into exile in Rhovanion, to the north. With the defeat of the king, Castamir seized the throne.\nFor ten years Castamir ruled Gondor with an iron fist, while Eldacar quietly regained power. Castamir ruled cruelly, and committed many foul deeds, including executing Eldacar's own son, Ornendil. At first the people of Gondor tolerated Castamir because of his pure Númenórean blood. Then, in 1447, Castamir, now called \"the Usurper\" by his people was overthrown after a decade of wicked rule with the people now rallying around the true king, Eldacar. He was slain by Eldacar's forces at the Battle of Erui, the decisive battle of the Kin-strife as this period came to be known. At the Crossings of Erui, Eldacar personally slew Castamir.\n"}, {"name": "N/a", "start": 1447, "end": 1490, "era": 1, "biog": "Castamir the Usurper usurped the throne of Gondor from Eldacar, ruling from TA 1437 to 1447 of the Third Age, until he was violently deposed at the Battle of Erui.\nThe great-grandson of the unremarkable King Calmacil, Castamir was not in line for the throne, but his royal background had made him the Lord of Ships under the previous king, Valacar. His lineage and influence left him in a position to challenge the current king, Eldacar, who was only half Dúnadan. As King Valacar's only son, Eldacar was the legitimate heir to the throne, but his half Rhovanion lineage angered citizens who believed in a pure dúnedain royalty. Capitalizing on what became outright protest against the current king, Castamir was able to incite rebellion and besiege Eldacar within the city Osgiliath in TA 1437 of the Third Age. The city was set on fire by Castamir's troops, destroying the famed Dome of Stars. Shortly thereafter, Eldacar fled the city and into exile in Rhovanion, to the north. With the defeat of the king, Castamir seized the throne.\nFor ten years Castamir ruled Gondor with an iron fist, while Eldacar quietly regained power. Castamir ruled cruelly, and committed many foul deeds, including executing Eldacar's own son, Ornendil. At first the people of Gondor tolerated Castamir because of his pure Númenórean blood. Then, in 1447, Castamir, now called \"the Usurper\" by his people was overthrown after a decade of wicked rule with the people now rallying around the true king, Eldacar. He was slain by Eldacar's forces at the Battle of Erui, the decisive battle of the Kin-strife as this period came to be known. At the Crossings of Erui, Eldacar personally slew Castamir.\n"}, {"name": "Aldamir", "start": 1490, "end": 1540, "era": 1, "biog": "Aldamir was the twenty-third King of Gondor (Castamir being counted the twenty-second).\nAldamir was the second son of King Eldacar of Gondor and succeeded him in TA 1490 because his elder brother Ornendil was executed by Castamir. Aldamir's fifty year reign was marked with constant warfare with the Corsairs of Umbar (among them were the sons of Castamir) and the Haradrim. He was slain in battle with the Men of Harad and Corsairs of Umbar in TA 1540 and was succeeded by his son Vinyarion.[2][3]\nAldamir was a Quenya word meaning 'Tree-jewel'.[4]\n"}, {"name": "Hyarmendacil II", "start": 1540, "end": 1621, "era": 1, "biog": "Hyarmendacil II was the twenty-fourth King of Gondor.\nHyarmendacil was the son of King Aldamir and reigned from TA 1540 until TA 1621. Born as Vinyarion, his father Aldamir was slain in a war with the Haradrim in TA 1540 and Vinyarion wished to avenge Aldamir's death. He accomplished this in TA 1551 by invading Harad and winning an astounding victory over the Haradrim and it was then when he proclaimed himself Hyarmendacil II, meaning in Sindarin \"South-victor\" after his famous ancestor from the twelfth century Third Age.\nHe died in TA 1621 after a rule of eighty-one years and two hundred thirty years of life and was succeeded by his son Minardil, who ruled for thirteen years before being slain at Pelargir.[2][3]\n"}, {"name": "Minardil", "start": 1621, "end": 1634, "era": 1, "biog": "Minardil was the twenty-fifth King of Gondor.\nMinardil was born in TA 1454[1] during the reign of his great-grandfather Eldacar and was the son and successor of King Hyarmendacil II whom he succeeded in TA 1621. His reign was brief and turbulent. His steward, Húrin of Emyn Arnen, would found the line of the House of Húrin, who became ruling stewards centuries later. In TA 1634, he was at Pelargir when it was suddenly attacked by the Corsairs of Umbar and he was slain. Minardil ruled for thirteen years and was succeeded by his eldest son Telemnar.[2][3]\nMinardil is a Quenya word that means 'Tower-lover'.[4]\n"}, {"name": "Telemnar", "start": 1634, "end": 1636, "era": 1, "biog": "Telemnar was the twenty-sixth King of Gondor.\nTelemnar became king after his father Minardil died in an attack by the Corsairs of Umbar at Pelargir in TA 1634. Due to this renewed threat from the Corsairs, he immediately began building up Gondor's fleets to defeat them but his plans came to an end when the Great Plague struck Gondor.[1] The Great Plague ravaged Gondor and many died especially in Osgiliath and as a result King Telemnar and his immediate family died.[3] The White Tree also withered and died during this time. He was succeeded by his nephew Tarondor, who was the son of Telemnar's younger brother Minastan.[1][2]\nHis father's reign was brief but his own reign was even briefer. He was the shortest reigning King of Gondor, together with Isildur.\n"}, {"name": "Tarondor", "start": 1636, "end": 1798, "era": 1, "biog": "Tarondor was the twenty-seventh King of Gondor.\nTarondor was the son of Minastan succeeded his uncle Telemnar, who died in the Great Plague of TA 1636, coming to the throne when he was still young because all his cousins died and was the longest-reigning King of Gondor.\nWar and plague had tortured his country and Tarondor strove to rebuild it and its power. The most significant event in his reign was the removal of the capital from the now depopulated Osgiliath to Minas Anor and the replanting of the White Tree. However, Gondor at this time was drained of its resources and man-power and could no longer afford to tend to the forts guarding the ancient entrances to Mordor, thus they fell into decay paving the way for evil things to return.[3] He died in TA 1798 after one-hundred and Sixty-two years of rule was succeeded by his son Telumehtar in TA 1798.[2]\n"}, {"name": "Telumehtar", "start": 1798, "end": 1850, "era": 1, "biog": "Telumehtar, also known as Telumehtar Umbardacil, was the twenty-eighth King of Gondor. He is most famous for his victory over the Corsairs of Umbar in TA 1810.\nTelumehtar succeeded his father Tarondor as king in TA 1798. His reign was largely uneventful save for problems with the Corsairs of Umbar. The long descendents of the defeated king Castamir the Usurper; the Corsairs raided the coasts of Gondor and terrorized shipping in the area. Resolved to end the troubles, Telumehtar assembled a large force in TA 1810 and recaptured by surprise their base in Umbar. After this event he took the title Umbardacil, meaning \"Victor over Umbar\". In this war, the Corsairs suffered total defeat and the descendants of Castamir all died and Umbar was yet again held by Gondor.\nTelumehtar ruled for fifty-two years and was succeeded by his son Narmacil II in TA 1850.[2]\n"}, {"name": "Narmacil II", "start": 1850, "end": 1856, "era": 1, "biog": "Narmacil II was the twenty-ninth King of Gondor and the son of Telumehtar.\nIn the sixth year of his brief reign, a federation of Easterlings called the Wainriders overran Gondor's territories on the eastern bank of the Anduin. Narmacil marched to Rhovanion to fight the invaders but was utterly defeated and slain at the Battle of the Plains. He was one-hundred and seventy-two years old and ruled for only six years. He was succeeded by his son Calimehtar.[2][3]\n\n"}, {"name": "Calimehtar", "start": 1856, "end": 1936, "era": 1, "biog": "Calimehtar was the thirtieth King of Gondor.\nCalimehtar succeeded his father Narmacil II in TA 1856 who was killed by the Wainriders during the defeat of Gondor at the Battle of the Plains.[3][4] Calimehtar was a good friend and ally of the Éothéod. In TA 1899, the Wainriders once again became a threat to Gondor and the lands of the west. During the strife, he built the White Tower of Gondor.[4] The Éothéod leader Marhwini warned the king of the impending invasion allowing him to assemble an army in Ithilien which he marched north, also sending Cavalry over the Undeeps to harass the unguarded enemy positions there. Calimehtar and his Éothéod allies finally met the Wainriders in Dagorlad where they defeated them. Narmacil II's death had been avenged. The victory of Gondor and its allies inspired the slaves in Rhovanion to rebel against their cruel Easterling masters.[3]\nHe died in TA 1936 after a rule of eighty years and was succeeded by his son Ondoher.[2] He was two-hundred years of age.\n"}, {"name": "Ondoher", "start": 1936, "end": 1944, "era": 1, "biog": "Ondoher was the thirty-first King of Gondor.\nOndoher as succeeded his father Calimehtar in TA 1936. His daughter Fíriel married Prince Arvedui of Arthedain.\nIn TA 1944, the Wainriders invaded Gondor from the east while their allies, the Haradrim, invaded Gondor from the south. Ondoher and his eldest son Artamir led the main army close to the Black Gate, where they clashed with the Wainriders. The left wing of Ondoher's army was commanded by Adrahil, the Prince of Dol Amroth. The right wing was commanded by Minothar, the captain of Gondor's armies. The center was commanded by Ondoher himself.\nIn the ensuing battle Ondoher was slain together with his eldest son and heir Artamir, and Gondor defeated.\nThe rearguard of the army defended Ithilien while Adrahil got help from General Eärnil, who had defeated the Haradrim.\n"}, {"name": "N/A", "start": 0, "end": 0, "era": -1, "biog": "N/A"}, {"name": "Eärnil II", "start": 1945, "end": 2043, "era": 1, "biog": "Eärnil II was the thirty-second King of Gondor.\nEärnil II was selected to become king in TA 1945 after his predecessor, King Ondoher and his heirs, was slain in battle. In the previous year a two-pronged attack had been launched upon Gondor by the Haradrim and the Wainriders. In response, King Ondoher led the main army north to counter the Easterling invasion at Dagorlad and was defeated. Eärnil was commander of Gondor's southern army and guarded Pelargir. Eärnil led his army to the Crossings of the Poros where he won an astounding victory over the Haradrim. This enabled him to turn his attention to the invading Wainriders. The Wainriders, certain of victory, were celebrating their success before they would enter Minas Anor. They were unaware of Eärnil's victory in the south and were taken by surprise when Eärnil suddenly attacked them. As a result Eärnil won the Battle of the Camp.\nAfter the threat was eliminated Gondor's attention shifted towards Steward Pelendur and the Council of Gondor, for King Ondoher along with his two sons were slain at Dagorlad. Both he and prince Arvedui of Arthedain (successor state of Arnor) claimed the throne. Arvedui based his claim on that he was the direct descendant of Isildur (second High King of Arnor and Gondor and uncle to Meneldil first King of Gondor), and as the husband of Fíriel, only surviving child of King Ondoher. The claim was rejected and Eärnil of the House of Anárion was elected king for his deeds, heritage, and because the Steward, Pelendur, claimed that \"The crown and royalty of Gondor belongs solely to the heirs of Meneldil, son of Anárion, to whom Isildur relinquished this realm. In Gondor, this heritage is reckoned through the sons only; and we have not heard that the law is otherwise in Arnor\". He reigned as Eärnil II.\n"}, {"name": "Eärnur", "start": 2043, "end": 2050, "era": 1, "biog": "Eärnur was the thirty-third and last King of Gondor until the restoration of the monarchy with Aragorn II Elessar. He took the throne upon the death of his father Eärnil II in TA 2043, and after his disappearance the Stewards of Gondor ruled in his name for many generations.\nEärnur was the son of Eärnil II. He was a great warrior and became a great leader of armies before he became King. His greatest victory was against Angmar in TA 1975 in the Battle of Fornost, in which he defeated the Witch-king, whom he intended to slay had his steed not panicked in terror of the Witch-king's darkness. It was to him that Glorfindel stated his prophecy that \"not by the hand of men shall he fall\" referring to the Witch-king as he fled from defeat. After becoming King in TA 2043, he was challenged by the Witch-king of Angmar, chief of the Ringwraiths, who then resided in Minas Morgul. Eärnur, being quick to anger and wrath, would have accepted his challenge had the wise Steward Mardil Voronwë not held him back, and so the first challenge went unanswered. In TA 2050 a second challenge came, mocking Eärnur, and Mardil was not able to stop Eärnur from accepting the challenge. After entering the gates of Minas Morgul with a small escort, Eärnur was never heard from again. His crown lay on his father's tomb in the Hallows of Minas Tirith.\nThe Line of Anárion was broken with Eärnur's dissappearance, and the rule of Gondor passed to the Stewards, beginning with Mardil Voronwë, who had tried to restrain Eärnur from going to Minas Morgul to face the Witch-king. The Stewards were to rule \"until the King returns\", for it was then unknown whether Eärnur had been killed dueling the Witch-king or not. Eärnur had also left without naming an heir, and while many nobles in Gondor could lay some sort of claim to the kingship, those claims were held in doubt, and no one wanted to risk a second civil war.[2]\n"}, {"name": "N/A", "start": 0, "end": 0, "era": -1, "biog": "N/A"}, {"name": "Aragorn II Elessar", "start": 3019, "end": 120, "era": 1, "biog": "TA 3019 - FO 120 (King)\nAragorn II, son of Arathorn II and Gilraen, also known as Elessar and Strider, was the 16th Chieftain of the Dúnedain of the North; later crowned King Elessar Telcontar (March 1, 2931 - FO 120 or SR 1541), the 26th King of Arnor and 35th King of Gondor - and first High King of Gondor and Arnor since the short reign of Isildur. He was a great ranger and warrior, and as Isildur's heir he bore the shards of Narsil, reforged and renamed Andúril, Flame of the West, in the War of the Ring. \n"}, {"name": "Eldarion", "start": 120, "end": 220, "era": 2, "biog": "Eldarion (Quenya: IPA; \"Son of the Eldar\") was the only son of Aragorn II Elessar and Arwen Undómiel,  King and Queen of the Reunited Kingdoms of Gondor and Arnor in Middle-earth.\nEldarion was born on an unspecified date, and is recorded to have several sisters. Next to nothing is known of his rule, except that he probably maintained the peace and the borders of the Reunited Kingdom as set down by his father after the War of the Ring.[1]\nThrough his father, Aragorn II Elessar, he is a direct descendant of Elendil, the grandson of Arathorn II and Gilraen, great-grandson of Arador and great-great grandson of Argonui; both from Dúnedain of the North.\n"}]